In [1]:
import pandas as pd

In [2]:
housing = pd.read_csv('melbourne.csv')

In [8]:
housing.shape

(23547, 21)

In [7]:
housing.shape

(23547, 21)

In [9]:
housing.isnull().sum()

Suburb               0
Address              0
Rooms                0
Type                 0
Price             5151
Method               0
SellerG              0
Date                 0
Distance             1
Postcode             1
Bedroom2          4481
Bathroom          4484
Car               4626
Landsize          6137
BuildingArea     13529
YearBuilt        12007
CouncilArea       7891
Lattitude         4304
Longtitude        4304
Regionname           1
Propertycount        1
dtype: int64

In [15]:
round((housing.isnull().sum()/len(housing))*100)

Suburb            0.0
Address           0.0
Rooms             0.0
Type              0.0
Price            22.0
Method            0.0
SellerG           0.0
Date              0.0
Distance          0.0
Postcode          0.0
Bedroom2         19.0
Bathroom         19.0
Car              20.0
Landsize         26.0
BuildingArea     57.0
YearBuilt        51.0
CouncilArea      34.0
Lattitude        18.0
Longtitude       18.0
Regionname        0.0
Propertycount     0.0
dtype: float64

In [18]:
housing = housing.drop(columns=['BuildingArea','YearBuilt','CouncilArea'])

In [19]:
housing.columns

Index(['Suburb', 'Address', 'Rooms', 'Type', 'Price', 'Method', 'SellerG',
       'Date', 'Distance', 'Postcode', 'Bedroom2', 'Bathroom', 'Car',
       'Landsize', 'Lattitude', 'Longtitude', 'Regionname', 'Propertycount'],
      dtype='object')

0        1
1        0
2        0
3        1
4        0
        ..
23542    1
23543    5
23544    1
23545    0
23546    1
Length: 23547, dtype: int64

In [22]:
housing.shape

(23547, 18)

In [23]:
housing.isnull().sum(axis = 1) > 4

0        False
1        False
2        False
3        False
4        False
         ...
23542    False
23543     True
23544    False
23545    False
23546    False
Length: 23547, dtype: bool

In [24]:
housing[housing.isnull().sum(axis = 1) > 4]

,Suburb,Address,Rooms,Type,Price,Method,SellerG,Date,Distance,Postcode,Bedroom2,Bathroom,Car,Landsize,Lattitude,Longtitude,Regionname,Propertycount
15,Abbotsford,217 Langridge St,3,h,1000000.0,S,Jellis,08-10-2016,2.5,3067.0,NaN,NaN,NaN,NaN,NaN,NaN,Northern Metropolitan,4019.0
16,Abbotsford,18a Mollison St,2,t,745000.0,S,Jellis,08-10-2016,2.5,3067.0,NaN,NaN,NaN,NaN,NaN,NaN,Northern Metropolitan,4019.0
19,Abbotsford,403/609 Victoria St,2,u,542000.0,S,Dingle,08-10-2016,2.5,3067.0,NaN,NaN,NaN,NaN,NaN,NaN,Northern Metropolitan,4019.0
21,Abbotsford,25/84 Trenerry Cr,2,u,760000.0,SP,Biggin,10-12-2016,2.5,3067.0,NaN,NaN,NaN,NaN,NaN,NaN,Northern Metropolitan,4019.0
22,Abbotsford,106/119 Turner St,1,u,481000.0,SP,Purplebricks,10-12-2016,2.5,3067.0,NaN,NaN,NaN,NaN,NaN,NaN,Northern Metropolitan,4019.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
23499,Thornbury,1/128 Dundas St,2,t,770000.0,PI,McGrath,26-08-2017,7.0,3071.0,NaN,NaN,NaN,NaN,NaN,NaN,Northern Metropolitan,8870.0
23502,Thornbury,111 Pender St,2,t,858000.0,S,Jellis,26-08-2017,7.0,3071.0,NaN,NaN,NaN,NaN,NaN,NaN,Northern Metropolitan,8870.0
23508,Toorak,21/1059 Malvern Rd,2,u,720000.0,VB,Beller,26-08-2017,4.1,3142.0,NaN,NaN,NaN,NaN,NaN,NaN,Southern Metropolitan,7217.0
23531,Werribee,91 Latham St,4,h,540000.0,PI,Triwest,26-08-2017,14.7,3030.0,NaN,NaN,NaN,NaN,NaN,NaN,Western Metropolitan,16166.0
23543,Wyndham Vale,19 Dalrymple Bvd,4,h,NaN,S,hockingstuart,26-08-2017,27.2,3024.0,NaN,NaN,NaN,NaN,-37.87882,144.60184,Western Metropolitan,5262.0

In [25]:
housing=housing[housing.isnull().sum(axis = 1) <= 4]

In [26]:
housing.shape

(19226, 18)

In [27]:
housing['Price'].fillna(1000) #fiils data in row

0           1000.0
1        1480000.0
2        1035000.0
3           1000.0
4        1465000.0
           ...
23541    2500000.0
23542       1000.0
23544    1100000.0
23545    1285000.0
23546    1050000.0
Name: Price, Length: 19226, dtype: float64

In [28]:
housing['Price'].mean()

1066694.6291263422

In [29]:
housing['Price'].fillna(housing['Price'].mean())

0        1.066695e+06
1        1.480000e+06
2        1.035000e+06
3        1.066695e+06
4        1.465000e+06
             ...
23541    2.500000e+06
23542    1.066695e+06
23544    1.100000e+06
23545    1.285000e+06
23546    1.050000e+06
Name: Price, Length: 19226, dtype: float64

In [30]:
housing['Price'] = housing['Price'].fillna(housing['Price'].mean())

In [127]:
housing.head()

,Suburb,Address,Rooms,Type,Price,Method,Seller,Date,Distance,Postcode,Bedroom,Bathroom,Car,Landsize,Lattitude,Longtitude,Regionname,Propertycount
0,Abbotsford,68 Studley St,2,h,1066694.63,SS,Jellis,03-09-2016,2.5,3067.0,2.0,1.0,1.0,126.0,-37.8014,144.9958,Northern Metropolitan,4019.0
1,Abbotsford,85 Turner St,2,h,1480000.00,S,Biggin,03-12-2016,2.5,3067.0,2.0,1.0,1.0,202.0,-37.7996,144.9984,Northern Metropolitan,4019.0
2,Abbotsford,25 Bloomburg St,2,h,1035000.00,S,Biggin,04-02-2016,2.5,3067.0,2.0,1.0,0.0,156.0,-37.8079,144.9934,Northern Metropolitan,4019.0
3,Abbotsford,18/659 Victoria St,3,u,1066694.63,VB,Rounds,04-02-2016,2.5,3067.0,3.0,2.0,1.0,0.0,-37.8114,145.0116,Northern Metropolitan,4019.0
4,Abbotsford,5 Charles St,3,h,1465000.00,SP,Biggin,04-03-2017,2.5,3067.0,3.0,2.0,0.0,134.0,-37.8093,144.9944,Northern Metropolitan,4019.0

In [126]:
def round_off(x):
 return round(x,2)

housing['Price'] = housing['Price'].apply(round_off)

In [124]:
housing.head()

,Suburb,Address,Rooms,Type,Price,Method,Seller,Date,Distance,Postcode,Bedroom,Bathroom,Car,Landsize,Lattitude,Longtitude,Regionname,Propertycount
0,Abbotsford,68 Studley St,2,h,1066694.63,SS,Jellis,03-09-2016,2.5,3067.0,2.0,1.0,1.0,126.0,-37.8014,144.9958,Northern Metropolitan,4019.0
1,Abbotsford,85 Turner St,2,h,1480000.00,S,Biggin,03-12-2016,2.5,3067.0,2.0,1.0,1.0,202.0,-37.7996,144.9984,Northern Metropolitan,4019.0
2,Abbotsford,25 Bloomburg St,2,h,1035000.00,S,Biggin,04-02-2016,2.5,3067.0,2.0,1.0,0.0,156.0,-37.8079,144.9934,Northern Metropolitan,4019.0
3,Abbotsford,18/659 Victoria St,3,u,1066694.63,VB,Rounds,04-02-2016,2.5,3067.0,3.0,2.0,1.0,0.0,-37.8114,145.0116,Northern Metropolitan,4019.0
4,Abbotsford,5 Charles St,3,h,1465000.00,SP,Biggin,04-03-2017,2.5,3067.0,3.0,2.0,0.0,134.0,-37.8093,144.9944,Northern Metropolitan,4019.0

In [32]:
housing.shape

(19226, 18)

In [33]:
housing.duplicated().sum()

1

In [34]:
housing[housing.duplicated()]

,Suburb,Address,Rooms,Type,Price,Method,SellerG,Date,Distance,Postcode,Bedroom2,Bathroom,Car,Landsize,Lattitude,Longtitude,Regionname,Propertycount
15858,Nunawading,1/7 Lilian St,3,t,1.066695e+06,SP,Jellis,17-06-2017,15.4,3131.0,3.0,3.0,2.0,405.0,-37.82678,145.16777,Eastern Metropolitan,4973.0

In [35]:
housing = housing.drop_duplicates()

In [40]:
housing = housing.rename(columns = {'SellerG':'Seller','Bedroom2':'Bedroom'})

In [41]:
housing.columns

Index(['Suburb', 'Address', 'Rooms', 'Type', 'Price', 'Method', 'Seller',
       'Date', 'Distance', 'Postcode', 'Bedroom', 'Bathroom', 'Car',
       'Landsize', 'Lattitude', 'Longtitude', 'Regionname', 'Propertycount'],
      dtype='object')

In [43]:
housing.isnull().sum()

Suburb              0
Address             0
Rooms               0
Type                0
Price               0
Method              0
Seller              0
Date                0
Distance            0
Postcode            0
Bedroom           160
Bathroom          163
Car               305
Landsize         1816
Lattitude          26
Longtitude         26
Regionname          0
Propertycount       0
dtype: int64

In [44]:
housing = housing.dropna()

In [51]:
housing.isnull().sum()

Suburb           0
Address          0
Rooms            0
Type             0
Price            0
Method           0
Seller           0
Date             0
Distance         0
Postcode         0
Bedroom          0
Bathroom         0
Car              0
Landsize         0
Lattitude        0
Longtitude       0
Regionname       0
Propertycount    0
dtype: int64

In [46]:
master = pd.read_csv('master_data.csv')

In [47]:
master.head()

,Ord_id,Prod_id,Ship_id,Cust_id,Sales,Discount,Order_Quantity,Profit,Shipping_Cost,Product_Base_Margin,Customer_Name,Province,Region,Customer_Segment,Product_Category,Product_Sub_Category
0,Ord_5446,Prod_16,SHP_7609,Cust_1818,136.81,0.01,23,-30.51,3.60,0.56,AARON BERGMAN,ALBERTA,WEST,CORPORATE,OFFICE SUPPLIES,"SCISSORS, RULERS AND TRIMMERS"
1,Ord_2978,Prod_16,SHP_4112,Cust_1088,305.05,0.04,27,23.12,3.37,0.57,AARON HAWKINS,ONTARIO,ONTARIO,HOME OFFICE,OFFICE SUPPLIES,"SCISSORS, RULERS AND TRIMMERS"
2,Ord_5484,Prod_16,SHP_7663,Cust_1820,322.82,0.05,35,-17.58,3.98,0.56,ADRIAN SHAMI,ALBERTA,WEST,CONSUMER,OFFICE SUPPLIES,"SCISSORS, RULERS AND TRIMMERS"
3,Ord_3730,Prod_16,SHP_5175,Cust_1314,459.08,0.04,34,61.57,3.14,0.60,ALEKSANDRA GANNAWAY,SASKACHEWAN,PRARIE,CORPORATE,OFFICE SUPPLIES,"SCISSORS, RULERS AND TRIMMERS"
4,Ord_4143,Prod_16,SHP_5771,Cust_1417,207.21,0.06,24,-78.64,6.14,0.59,ALLEN ARMOLD,NEW BRUNSWICK,ATLANTIC,HOME OFFICE,OFFICE SUPPLIES,"SCISSORS, RULERS AND TRIMMERS"

In [49]:
master['Profit'].sum()

1521767.98

In [54]:
by_cust_segment.groups

{'CONSUMER': [2, 33, 34, 43, 53, 57, 60, 64, 69, 70, 71, 73, 75, 93, 98, 103, 116, 120, 122, 124, 129, 130, 131, 132, 134, 135, 139, 143, 159, 160, 161, 176, 177, 178, 183, 184, 186, 187, 193, 194, 197, 206, 207, 214, 215, 236, 245, 246, 251, 254, 265, 266, 274, 275, 276, 287, 288, 302, 311, 318, 319, 321, 344, 347, 356, 357, 383, 384, 387, 389, 390, 395, 404, 405, 406, 412, 413, 425, 426, 433, 441, 442, 443, 445, 447, 452, 466, 476, 477, 488, 490, 521, 526, 527, 528, 533, 555, 556, 564, 568, ...], 'CORPORATE': [0, 3, 7, 9, 11, 14, 15, 16, 21, 22, 23, 27, 30, 31, 35, 36, 37, 40, 41, 42, 47, 48, 49, 55, 58, 61, 63, 65, 72, 74, 77, 78, 79, 80, 83, 84, 85, 86, 88, 92, 96, 99, 101, 104, 105, 108, 111, 114, 117, 121, 125, 127, 128, 133, 137, 142, 144, 150, 151, 152, 153, 154, 155, 156, 157, 158, 162, 169, 171, 172, 185, 191, 192, 202, 203, 204, 205, 212, 213, 216, 217, 218, 219, 220, 235, 238, 239, 243, 247, 248, 249, 250, 257, 258, 262, 263, 264, 272, 273, 277, ...], 'HOME OFFICE': [1, 4, 12, 13, 17, 18, 19, 25, 29, 32, 38, 44, 46, 50, 52, 54, 59, 62, 67, 68, 76, 81, 82, 87, 89, 97, 100, 102, 107, 110, 112, 113, 118, 119, 123, 126, 136, 140, 141, 145, 170, 173, 174, 175, 188, 189, 195, 196, 198, 199, 208, 209, 210, 228, 229, 230, 240, 241, 242, 244, 255, 256, 259, 260, 261, 285, 286, 290, 295, 312, 313, 314, 317, 322, 323, 326, 327, 328, 329, 337, 339, 340, 341, 345, 346, 349, 354, 355, 359, 367, 368, 369, 370, 381, 382, 385, 386, 400, 407, 410, ...], 'SMALL BUSINESS': [5, 6, 8, 10, 20, 24, 26, 28, 39, 45, 51, 56, 66, 90, 91, 94, 95, 106, 109, 115, 138, 146, 147, 148, 149, 163, 164, 165, 166, 167, 168, 179, 180, 181, 182, 190, 200, 201, 211, 221, 222, 223, 224, 225, 226, 227, 231, 232, 233, 234, 237, 252, 253, 267, 268, 269, 270, 271, 289, 293, 294, 296, 297, 298, 307, 309, 315, 320, 325, 330, 331, 332, 333, 350, 358, 361, 362, 363, 391, 392, 394, 398, 399, 403, 409, 411, 423, 431, 434, 439, 471, 474, 486, 487, 512, 513, 514, 515, 516, 520, ...]}

In [55]:
by_cust_segment.get_group('CORPORATE')

,Ord_id,Prod_id,Ship_id,Cust_id,Sales,Discount,Order_Quantity,Profit,Shipping_Cost,Product_Base_Margin,Customer_Name,Province,Region,Customer_Segment,Product_Category,Product_Sub_Category
0,Ord_5446,Prod_16,SHP_7609,Cust_1818,136.81,0.01,23,-30.51,3.60,0.56,AARON BERGMAN,ALBERTA,WEST,CORPORATE,OFFICE SUPPLIES,"SCISSORS, RULERS AND TRIMMERS"
3,Ord_3730,Prod_16,SHP_5175,Cust_1314,459.08,0.04,34,61.57,3.14,0.60,ALEKSANDRA GANNAWAY,SASKACHEWAN,PRARIE,CORPORATE,OFFICE SUPPLIES,"SCISSORS, RULERS AND TRIMMERS"
7,Ord_4506,Prod_16,SHP_6273,Cust_1544,92.02,0.07,9,-24.88,4.68,0.59,AMY COX,YUKON,YUKON,CORPORATE,OFFICE SUPPLIES,"SCISSORS, RULERS AND TRIMMERS"
9,Ord_1551,Prod_16,SHP_2145,Cust_531,184.77,0.00,29,-71.96,5.30,0.55,ANDY YOTOV,ONTARIO,ONTARIO,CORPORATE,OFFICE SUPPLIES,"SCISSORS, RULERS AND TRIMMERS"
11,Ord_1429,Prod_16,SHP_1976,Cust_510,539.06,0.05,42,-123.07,4.59,0.82,ANNA HABERLIN,ONTARIO,ONTARIO,CORPORATE,OFFICE SUPPLIES,"SCISSORS, RULERS AND TRIMMERS"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
8384,Ord_1265,Prod_14,SHP_1749,Cust_466,24051.49,0.07,41,9791.04,24.49,0.37,RITSA HIGHTOWER,ONTARIO,ONTARIO,CORPORATE,TECHNOLOGY,COPIERS AND FAX
8385,Ord_669,Prod_14,SHP_916,Cust_224,20872.16,0.03,29,-4437.91,24.49,0.41,ROY SKARIA,BRITISH COLUMBIA,WEST,CORPORATE,TECHNOLOGY,COPIERS AND FAX
8386,Ord_171,Prod_14,SHP_231,Cust_1194,6350.29,0.02,10,-735.97,24.49,0.50,ROY SKARIA,MANITOBA,PRARIE,CORPORATE,TECHNOLOGY,COPIERS AND FAX
8387,Ord_1390,Prod_14,SHP_1919,Cust_537,6933.45,0.04,15,1200.21,49.00,0.38,RUBEN AUSMAN,ONTARIO,ONTARIO,CORPORATE,TECHNOLOGY,COPIERS AND FAX
8398,Ord_3610,Prod_14,SHP_4998,Cust_1266,1759.65,0.06,3,-2213.75,24.49,0.50,WILLIAM BROWN,SASKACHEWAN,PRARIE,CORPORATE,TECHNOLOGY,COPIERS AND FAX

In [56]:
by_cust_segment['Profit'].sum()

Customer_Segment
CONSUMER          287959.94
CORPORATE         599746.00
HOME OFFICE       318354.03
SMALL BUSINESS    315708.01
Name: Profit, dtype: float64

In [57]:
by_cust_segment['Profit'].sum().sort_values()

Customer_Segment
CONSUMER          287959.94
SMALL BUSINESS    315708.01
HOME OFFICE       318354.03
CORPORATE         599746.00
Name: Profit, dtype: float64

In [58]:
by_cust_segment['Profit'].sum().sort_values(ascending = False)

Customer_Segment
CORPORATE         599746.00
HOME OFFICE       318354.03
SMALL BUSINESS    315708.01
CONSUMER          287959.94
Name: Profit, dtype: float64

In [64]:
by_cust_segment['Profit'].sum()

Product_Category
FURNITURE          117433.03
OFFICE SUPPLIES    518021.43
TECHNOLOGY         886313.52
Name: Profit, dtype: float64

In [66]:
by_cat_subcat = master.groupby(['Product_Category','Product_Sub_Category'])

In [68]:
by_cat_subcat['Profit'].sum()

Product_Category  Product_Sub_Category
FURNITURE         BOOKCASES                         -33582.13
                  CHAIRS & CHAIRMATS                149649.73
                  OFFICE FURNISHINGS                100427.93
                  TABLES                            -99062.50
OFFICE SUPPLIES   APPLIANCES                         97158.06
                  BINDERS AND BINDER ACCESSORIES    307413.39
                  ENVELOPES                          48182.60
                  LABELS                             13677.17
                  PAPER                              45263.20
                  PENS & ART SUPPLIES                 7564.78
                  RUBBER BANDS                        -102.67
                  SCISSORS, RULERS AND TRIMMERS      -7799.25
                  STORAGE & ORGANIZATION              6664.15
TECHNOLOGY        COMPUTER PERIPHERALS               94287.48
                  COPIERS AND FAX                   167361.49
                  OFFICE MACHINES                   307712.93
                  TELEPHONES AND COMMUNICATION      316951.62
Name: Profit, dtype: float64

In [69]:
data = pd.read_csv('weather_data.csv')

In [70]:
data.head()

   Temperature  DewPoint  Pressure       Date_Time
0         46.2      37.5         1  20100101 00:00
1         44.6      37.1         1  20100101 01:00
2         44.1      36.9         1  20100101 02:00
3         43.8      36.9         1  20100101 03:00
4         43.5      36.8         1  20100101 04:00

In [73]:
data = pd.read_csv('weather_data.csv',parse_dates = ['Date_Time'])

In [74]:
data.head()

   Temperature  DewPoint  Pressure           Date_Time
0         46.2      37.5         1 2010-01-01 00:00:00
1         44.6      37.1         1 2010-01-01 01:00:00
2         44.1      36.9         1 2010-01-01 02:00:00
3         43.8      36.9         1 2010-01-01 03:00:00
4         43.5      36.8         1 2010-01-01 04:00:00

In [75]:
data['year'] = data['Date_Time'].dt.year
data['month'] = data['Date_Time'].dt.month
data['day'] = data['Date_Time'].dt.day

In [76]:
data.head()

   Temperature  DewPoint  Pressure           Date_Time  year  month  day
0         46.2      37.5         1 2010-01-01 00:00:00  2010      1    1
1         44.6      37.1         1 2010-01-01 01:00:00  2010      1    1
2         44.1      36.9         1 2010-01-01 02:00:00  2010      1    1
3         43.8      36.9         1 2010-01-01 03:00:00  2010      1    1
4         43.5      36.8         1 2010-01-01 04:00:00  2010      1    1

In [98]:
data = pd.read_csv('weather_data.csv', index_col = 'Date_Time',parse_dates = True)

In [100]:
data.head()

                     Temperature  DewPoint  Pressure
Date_Time
2010-01-01 00:00:00         46.2      37.5         1
2010-01-01 01:00:00         44.6      37.1         1
2010-01-01 02:00:00         44.1      36.9         1
2010-01-01 03:00:00         43.8      36.9         1
2010-01-01 04:00:00         43.5      36.8         1

In [101]:
data.index.name = None

In [102]:
data.head()

                     Temperature  DewPoint  Pressure
2010-01-01 00:00:00         46.2      37.5         1
2010-01-01 01:00:00         44.6      37.1         1
2010-01-01 02:00:00         44.1      36.9         1
2010-01-01 03:00:00         43.8      36.9         1
2010-01-01 04:00:00         43.5      36.8         1

In [105]:
data.loc['2010-02-05 11:00:00']

Temperature    54.0
DewPoint       41.0
Pressure        1.0
Name: 2010-02-05 11:00:00, dtype: float64

In [107]:
data.loc['2010-02-05 11:00:00': '2011-02-05 17:00:00' ]

                     Temperature  DewPoint  Pressure
2010-02-05 11:00:00         54.0      41.0         1
2010-02-05 12:00:00         56.1      40.7         1
2010-02-05 13:00:00         58.1      40.9         1
2010-02-05 14:00:00         59.6      40.8         1
2010-02-05 15:00:00         60.4      40.7         1
...                          ...       ...       ...
2010-12-31 19:00:00         51.1      38.1         1
2010-12-31 20:00:00         49.0      37.9         1
2010-12-31 21:00:00         47.9      37.9         1
2010-12-31 22:00:00         46.9      37.9         1
2010-12-31 23:00:00         46.2      37.7         1

[7908 rows x 3 columns]

In [109]:
iris = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data')

In [110]:
iris.head()

   5.1  3.5  1.4  0.2  Iris-setosa
0  4.9  3.0  1.4  0.2  Iris-setosa
1  4.7  3.2  1.3  0.2  Iris-setosa
2  4.6  3.1  1.5  0.2  Iris-setosa
3  5.0  3.6  1.4  0.2  Iris-setosa
4  5.4  3.9  1.7  0.4  Iris-setosa

In [111]:
columns = ['sepal_len','sepal_wid','petal_len','petal_wid','class']

In [113]:
columns

['sepal_len', 'sepal_wid', 'petal_len', 'petal_wid', 'class']

In [115]:
iris = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data', names = columns)

In [116]:
iris.head()

   sepal_len  sepal_wid  petal_len  petal_wid        class
0        5.1        3.5        1.4        0.2  Iris-setosa
1        4.9        3.0        1.4        0.2  Iris-setosa
2        4.7        3.2        1.3        0.2  Iris-setosa
3        4.6        3.1        1.5        0.2  Iris-setosa
4        5.0        3.6        1.4        0.2  Iris-setosa

# apply function to dataset

In [118]:
def twice(x):
    return x*2

master['Profit'].apply(twice)

0         -61.02
1          46.24
2         -35.16
3         123.14
4        -157.28
          ...
8394     1976.40
8395     -783.84
8396     8352.50
8397    10970.30
8398    -4427.50
Name: Profit, Length: 8399, dtype: float64

In [122]:
def round_off(x):
 return round(x,2)

housing['Price'] = housing['Price'].apply(round_off)